import React, { useState } from "react";
import { doc, setDoc } from "firebase/firestore";
import { db } from "./firebaseConfog";
const accordionData = {
  title: "ԱՆՀՐԱԺԵՇՏ ՏԵՂԵԿԱՏՎՈՒԹՅՈՒՆ",
  items: [
    {
      id: "docs",
      title: "Անհրաժեշտ փաստաթղթեր",
      content: [
        "Հաշվի բացման դիմում՝ մեր ձևանմուշի համաձայն:",
        "Անձնագիր և սոցիալական քարտ կամ այն չունենալու մասին տեղեկանք, կամ միայն նույնականացման քարտ:",
        "Մեր պահանջով այլ փաստաթղթեր:"
      ]
    },
    {
      id: "procedure",
      title: "Հաշիվ բացելու ընթացակարգ",
      content: [
        "Ընթացիկ հաշիվ կարող եք բացել դրամով, դոլարով, եվրոյով, ռուբլով, կանադական դոլարով, ֆրանկով և ֆունտ ստեռլինգով (այլ արտարժույթներով ընթացիկ հաշիվներ կարող եք բացել միայն մեզ հետ համաձայնեցված կարգով):",
        "Նախքան հաշվի բացումը մեր աշխատակիցները ձեզ տեղեկացնում են հաշիվների բացման ու սպասարկման պայմանների, սակագների, պահանջվող փաստաթղթերի և այլ մանրամասների մասին:",
        "Եթե հաշվի բացման և վարման պայմաններն ընդունելի են, ապա լրացնում եք դիմում և ներկայացնում պահանջվող փաստաթղթերը:",
        "«Փողերի լվացման և ահաբեկչության ֆինանսավորման դեմ պայքարի մասին» ՀՀ օրենքի պահանջներից ելնելով` կարող ենք պահանջել լրացուցիչ փաստաթղթեր կամ ներկայացված փաստաթղթերը լրացուցիչ ուսումնասիրել:",
        "Ներկայացված փաստաթղթերի իսկությունն ու վավերականությունը ստուգելուց հետո ձեզ հետ կնքում ենք «Բանկային հաշվի սպասարկման պայմանագիրը» և հաշիվ բացում 1 (մեկ) աշխատանքային օրվա ընթացքում: Կնքված պայմանագրի օրինակի հետ ձեզ ենք հանձնում նաև Ավանդների հատուցման երաշխավորման պայմանների և կարգի մասին ծանուցում:",
        "Հաշիվները կարող եք բացել ինչպես մեր գործունեության վայրում, այնպես էլ հեռակառավարման համակարգերի միջոցով:",
        "Հեռակառավարման համակարգերով հաշիվները բացում ենք մեր կայքի կամ բջջային հավելվածի միջոցով ներկայացված էլեկտրոնային հայտ/դիմում-ի հիման վրա, որի համար կիրառվում են Համալիր բանկային ծառայությունների մատուցման պայմաններով սահմանված՝ ձեր հավաստագրման և նույնականացման միջոցները:",
        "Հաշիվ բացելուց հետո կարող եք իրականացնել ՀՀ օրենսդրությամբ չարգելված ցանկացած գործառնություն:",
      ]
    },
    {
      id: "service",
      title: "Բանկային հաշիվների սպասարկում",
      content: [
        "Ձեր բանկային հաշիվների սպասարկումը կարգավորվում է ՀՀ օրենսդրությամբ, ՀՀ Կենտրոնական բանկի նորմատիվ ակտերով, մեր և ձեր միջև կնքված բանկային հաշվի սպասարկման պայմանագրով: Բանկային հաշիվների սպասարկումն իրականացնում են մեր գլխամասային գրասենյակը և մասնաճյուղերը (հաճախորդների սպասարկման համապատասխան ստորաբաժանումների միջոցով): Հաշիվները սպասարկում ենք մեր սահմանած գործառնական օրվա ընթացքում՝ ժամը 9:30-17:00-ը, առանց ընդմիջման: Ձեր հաշիվներով իրականացվող գործառնությունների դիմաց գանձում ենք համապատասխան միջնորդավճարներ՝ մեր Սակագների համաձայն: Բանկային հաշիվների վարման սպասարկումն անվճար է: Հաշվի չնվազող մնացորդի պահանջ սահմանված չէ:",
        "Ձեր բանկային հաշիվներով կարող եք կատարել ՀՀ օրենսդրական ակտերով չարգելված ցանկացած գործառնություն (կանխիկ կամ անկանխիկ)՝ մեզ ներկայացնելով ՀՀ իրավական նորմերին համապատասխանող փաստաթղթային հանձնարարական: Բանկային հաշվով կարող եք կատարել հետևյալ գործառնությունները՝բացված հաշվին մուտքագրել դրամական միջոցներ,կատարել հաշվից փոխանցումներ,հաշվից գումարներ ստանալ,ընթացիկ հաշվի մնացորդը փոխարկել արտարժույթի (գործարքի կատարման դրությամբ մեր սահմանած` արտարժույթների առք ու վաճառքի փոխարժեքներով),ընթացիկ հաշվից մարել վարկեր:",
        "Կարող եք նաև հեռակառավարել ձեր հաշիվները՝ բանկային հաշիվների հեռակառավարման (online) մեր համակարգերի միջոցով:",
        "Բանկային հաշիվների բոլոր գործառնությունները (դրամական միջոցների շարժ, գանձված միջնորդավճարներ, ստացված եկամուտներ) արտացոլվում են քաղվածքներում: Մեր և ձեր միջև ձեռք բերված համաձայնության հիման վրա քաղվածքները կարող են տրամադրվել առձեռն, փոստային կամ էլեկտրոնային կապի միջոցներով: Քաղվածքների կրկնօրինակների և/կամ հաշիվների վերաբերյալ այլ տեղեկությունների (տեղեկանքների) տրամադրման դիմաց գանձում ենք միջնորդավճարներ՝ մեր սակագների համաձայն:",
        "Ձեր հաշվին դրամական միջոցների մուտքագրման/ելքագրման ժամկետները՝1.Ձեր օգտին ստացված դրամական միջոցները մուտքագրվում են ոչ ուշ, քան մուտքագրումը հաստատող փաստաթղթերի ստացման հաջորդող բանկային օրը: Հաշվի կանխիկ համալրման դեպքում՝ դրամական միջոցները մուտքագրվում են նույն բանկային օրը:2.Ձեր հաշվից դրամական միջոցների ելքագրումը (փոխանցումների իրականացումը) կատարվում է՝ ձեր կողմից մեզ ներկայացված վճարման հանձնարարագրերի հիմքերով, ընդ որում՝ մինչև ժամը 15:30-ը ներկայացված վճարման հանձնարարագրերը կատարում ենք նույն բանկային օրը:",
        "Բանկային հաշիվների սպասարկմանն առնչվող այլ պայմաններին կարող եք ծանոթանալ հետևյալ հղումներով՝Ձեր հաշիվներով իրականացվող փոխանցումների և կանխիկ գործառնությունների պայմաններին՝ Բանկային ծառայություններ բաժնի Դրամական փոխանցումներ ենթաբաժնում և Սակագներ բաժնի Դրամարկղային գործառնություններ ենթաբաժնում:Հաճախորդների ընթացիկ հաշիվների մնացորդների դիմաց հաշվարկվող տոկոսադրույքներին՝ Սակագներ բաժնի Ընթացիկ հաշիվներ ենթաբաժնում: Նշում. մենք իրավունք ունենք փոփոխելու բանկային հաշվին եղած դրամական միջոցների համար վճարվող տոկոսների չափը, եթե հաշվի սպասարկման պայմանագրով այլ բան նախատեսված չէ:Հաճախորդի պահանջով՝ Հայաստանում կամ Հայաստանի տարածքից դուրս կատարված գործարքների վերաբերյալ հարցման սակագներին՝ Սակագներ բաժնի Բանկային փոխանցումներ ենթաբաժնում:",
        "Բանկի կողմից Վճարման հանձնարարականի դրոշմակնիքումը հաստատում է այն փաստը, որ վճարման հանձնարարականն ընդունվել է Բանկի կողմից ի կատարման: Այն դեպքերում, երբ ընդունված վճարման հանձնարարականի կատարման ժամանակ ի հայտ են գալիս ցանկացած տեսակի անհամապատասխանություններ, այդ թվում՝ Հաճախորդի հաշվի անբավարար մնացորդ, ապա Բանկն իրավունք ունի չակցեպտավորել վճարման հանձնարարականը և այն համարել չեղյալացված: Սույն գործողության արդյունքում Հաճախորդին պատճառված վնասի համար Բանկը պատասխանատվություն չի կրում:",
      ]
    },
    {
      id: "other_terms",
      title: "Հաշիվների սպասարկմանն առնչվող այլ դրույթներ",
      content: [
        "Բանկային հաշվին առկա դրամական միջոցները տնօրինելու ձեր իրավունքները չենք սահմանափակում:",
        "Հաշվետիրոջ ձեր իրավունքները կարող են սահմանափակվել դատարանի վճռով, դատական ակտերի հարկադիր կատարումն ապահովող մարմինների կամ հարկային մարմինների կողմից ներկայացված հայտի հիման վրա: Առանց ձեր կարգադրության՝ հաշվից դրամական միջոցները կարող են բռնագանձվել դատարանի վճռով հարկադիր կատարումն ապահովող մարմինների և հարկային մարմինների ներկայացրած հայտի հիման վրա: Այս դեպքերում մենք պարտավորություն չենք կրում ձեր հանդեպ, ձեր հաշիվների և դրամական միջոցների նկատմամբ ՀՀ օրենսդրական կարգով կիրառվող իրավական սանկցիաների մասին տեղեկացնելու համար: Նման տեղեկատվություն կարող ենք տրամադրել միայն համապատասխան սանկցիաները կիրառելուց հետո՝ հեռախոսի կամ այլ կապի միջոցներով (էլեկտրոնային/փոստային):",
        "Երաշխավորում ենք հաշվի, հաշվով գործառնությունների և ձեր մասին տեղեկությունների գաղտնիությունը: Նման տեղեկություններ տրամադրում ենք միայն ձեզ կամ ձեր լիազոր ներկայացուցչին: Պետական մարմիններին և դրանց պաշտոնատար անձանց բանկային գաղտնիք կազմող տեղեկությունները տրամադրում ենք՝ միայն Բանկային գաղտնիքի մասին ՀՀ օրենքի համաձայն:",
        "Մեր և ձեր միջև ծագած ցանկացած վեճ և տարաձայնություն նախ և առաջ լուծվում է փոխադարձ բանակցությունների միջոցով, իսկ համաձայնության չգալու դեպքում՝ դատական կարգով և ֆինանսական համակարգի հաշտարարի միջոցով:",
      ]
    },
    {
      id: "cancellation",
      title: "Բանկային հաշվի պայմանագրի լուծման պայմաններ",
      content: [
        "Դուք ցանկացած ժամանակ կարող եք պահանջել լուծել բանկային հաշվի սպասարկման պայմանագիրը և ձեր հայեցողությամբ տնօրինել հաշվին առկա դրամական մնացորդը (կանխիկ ելքագրել կամ փոխանցել այլ հաշվի): Այս դեպքերում հաշվին եղած դրամական միջոցների մնացորդը տրամադրում ենք ձեզ կամ ձեր ցուցումով փոխանցում այլ հաշվի՝ ձեր համապատասխան գրավոր դիմումը ստանալուց ոչ ուշ, քան 7 (յոթ) օրվա ընթացքում:",
        "Կարող ենք անվիճելի կարգով դադարեցնել բանկային հաշվի սպասարկման պայմանագիրը, եթե լինելով ֆիզիկական անձ հաճախորդ՝ վեց ամսվա ընթացքում ձեր բանկային հաշվով գործառնություններ չեք կատարել, իսկ մնացորդը զրոյական է:",
        "Բանկային հաշվի պայմանագրի լուծումը հիմք է ձեր հաշիվը փակելու համար:",
      ]
    },
    {
      id: "guarantee_limits",
      title: "Երաշխավորված ավանդների սահմանաչափերը",
      content: [
        "Համաձայն «Ֆիզիկական անձանց բանկային ավանդների հատուցումը երաշխավորելու մասին» ՀՀ օրենքի՝ բանկում բացված հաշվարկային, ընթացիկ, ժամկետային, խնայողական կամ այլ հաշվի վրա գտնվող դրամական միջոցները համարվում են բանկային ավանդ: ՀՀ օրենքով երաշխավորված ավանդները հատուցում է Ավանդների հատուցումը երաշխավորող հիմնադրամը: Եթե դուք անվճարունակ բանկում ունեք՝",
        "Միայն դրամային ավանդ ապա երաշխավորված ավանդի չափը 16 միլիոն դրամ է:",
        "Միայն արտարժութային ավանդ ապա երաշխավորված ավանդի չափը 7 միլիոն դրամ է:",
        "Դրամային ու արտարժութային ավանդներ, և դրամային ավանդը 7 միլիոն դրամից ավելի է, ապա երաշխավորվում է միայն դրամային ավանդը՝ մինչև 16 միլիոն դրամով:",
        "Դրամային ու արտարժութային բանկային ավանդներ, և ձեր դրամային ավանդի գումարը պակաս է 7 միլիոն դրամից, ապա երաշխավորվում է դրամային ավանդն ամբողջությամբ և արտարժութային ավանդը՝ 7 միլիոն դրամի և հատուցված դրամային բանկային ավանդի տարբերության չափով:",
        "Ծանոթագրություն. Նույն բանկում ունեցած ձեր բոլոր դրամային ավանդները համարվում են մեկ ավանդ, և բոլոր արտարժութային ավանդները՝ մեկ ավանդ: Եթե ունեք ավանդներ ՀՀ տարածքում գործող մի քանի բանկերում, ապա դրանք երաշխավորվում են յուրաքանչյուր բանկում`առավելագույն սահմանաչափով։",
      ]
    },
    {
      id: "warning",
      title: "ՈՒՇԱԴՐՈՒԹՅՈՒՆ",
      content: [
        "Առարկայազուրկ մետաղական հաշիվների, Ավանդային և Քարտային հաշիվների սպասարկման պայմաններին կարող եք ծանոթանալ Առարկայազուրկ մետաղական հաշիվներ, Վճարային քարտեր ենթաբաժիններում և ֆիզիկական անձանց բանկային ծառայությունների Ավանդներ բաժնում:",
        "Ձեր հաշվում առկա միջոցների նկատմամբ տոկոսագումարները հաշվարկվում են ԱՆՎԱՆԱԿԱՆ ՏՈԿՈՍԱԴՐՈՒՅՔԻ հիման վրա: Իակ ՏԱՐԵԿԱՆ ՏՈԿՈՍԱՅԻՆ ԵԿԱՄՏԱԲԵՐՈՒԹՅՈՒՆԸ ցույց է տալիս, թե որքան եկամուտ կստանայիք Դուք, եթե Ձեր ավանդի դիմաց ստացված տոկոսագումարները վերաներդնեիք ավանդի տեսքով: ՏԱՐԵԿԱՆ ՏՈԿՈՍԱՅԻՆ ԵԿԱՄՏԱԲԵՐՈՒԹՅԱՆ հաշվարկման կարգին կարող եք ծանոթանալ ԱՅՍՏԵՂ:",
        "Համաձայն «Ֆիզիկական անձանց բանկային ավանդների հատուցումը երաշխավորելու մասին» ՀՀ օրենքի՝ բանկում բացված հաշվարկային, ընթացիկ, ժամկետային, խնայողական կամ այլ հաշվի վրա գտնվող դրամական միջոցները համարվում են բանկային ավանդ: ՀՀ օրենքով երաշխավորված ավանդները հատուցում է Ավանդների հատուցումը երաշխավորող հիմնադրամը:",
      ]
    },
    {
      id: "warning2",
      title: "Օտարերկրյա Հաշիվների Հարկման Հմապատասխանության ակտի (FATCA) ծանուցում",
      content: [
        "Հարգելի Հաճախորդ,",
        "«ԷՎՈԿԱԲԱՆԿ» ԲԲԸ-ն Հայաստանի Հանրապետության և Ամերիկայի Միացյալ Նահանգների միջև «Օտարերկրյա հաշիվների հարկային համապատասխանության ակտի» կիրարկմանն օժանդակելու համագործակցության մասին համաձայնագրի պահանջներից ելնելով իրավասու է հաճախորդներից պահանջել լրացուցիչ տեղեկատվություն, մասնավորապես հաճախորդներից պահանջվում է լրացնել վերջիններիս ԱՄՆ անձ կարգավիճակի նույնականացման համար պահանջվող հետևյալ ձևաթղթերը՝ Իրավաբանական անձ հաճախորդների ինքնահայտարարագրման ձև` Մոդել 2-ի համաձայն (FATCA) կամ Ֆիզիկական անձ (ներառյալ անհատ ձեռնարկատեր) հաճախորդների ինքնահայտարարագրման ձև FATCA նպատակների համար",
      ]
    }
  ]
};

function HashivneriMasin4() {
  const [openId, setOpenId] = useState("docs");
  const toggleAccordion = (id) => {
    setOpenId((prevId) => (prevId === id ? null : id));
  };
const uploadDataToFirebase = async () => {
    try {
      for (const item of accordionData.items) {
        const docRef = doc(db, "hashivneriMasin", item.id);
        

        await setDoc(docRef, {
          title: item.title,
          content: item.content
        });
      }
      alert("Տվյալները հաջողությամբ պահպանվել են Firebase-ում:");
    } catch (error) {
      console.error("Սխալ տվյալները պահպանելիս:", error);
    }
  };
  return (
    <div className="w-full max-w-4xl mx-auto p-4 font-sans">
<button 
          onClick={uploadDataToFirebase}
          className="bg-purple-600 text-white px-4 py-2 rounded-lg text-sm hover:bg-purple-700 transition"
        >
          Ուղարկել Firebase
        </button>
      <h2 className="text-xl font-bold uppercase mb-6 text-slate-900 tracking-wide">
        {accordionData.title}
      </h2>

      <div className="flex flex-col gap-3">
        {accordionData.items.map((item) => {
          const isOpen = openId === item.id;

          return (
            <div
              key={item.id}
              className={`border rounded-2xl transition-all duration-200 overflow-hidden ${
                isOpen
                  ? "border-purple-600 shadow-sm"
                  : "border-purple-200 hover:border-purple-300"
              }`}
            >
              <button
                onClick={() => toggleAccordion(item.id)}
                className="w-full text-left p-5 flex items-center gap-4 bg-white focus:outline-none"
              >
                <span className="text-purple-700 transition-transform duration-200">
                  {isOpen ? (
                    <svg
                      className="w-5 h-5 stroke-[2.5]"
                      fill="none"
                      stroke="currentColor"
                      viewBox="0 0 24 24"
                    >
                      <path
                        strokeLinecap="round"
                        strokeLinejoin="round"
                        d="M5 15l7-7 7 7"
                      />
                    </svg>
                  ) : (
                    <svg
                      className="w-5 h-5 stroke-[2.5]"
                      fill="none"
                      stroke="currentColor"
                      viewBox="0 0 24 24"
                    >
                      <path
                        strokeLinecap="round"
                        strokeLinejoin="round"
                        d="M19 9l-7 7-7-7"
                      />
                    </svg>
                  )}
                </span>

                <span className="font-bold text-slate-800 text-base">
                  {item.title}
                </span>
              </button>

              {isOpen && item.content?.length > 0 && (
                <div className="px-14 pb-6 pt-1 text-slate-700 text-sm leading-relaxed">
                  <ul className="list-disc flex flex-col gap-3 marker:text-purple-600">
                    {item.content.map((point, index) => (
                      <li key={index} className="pl-1">
                        {point}
                      </li>
                    ))}
                  </ul>
                </div>
              )}
            </div>
          );
        })}
      </div>
    </div>
  );
}
export default HashivneriMasin4